import java.text.DecimalFormat;
import java.text.SimpleDateFormat;
import java.util.Calendar;

public class Ch5Emart {
	public static void main(String[] args) {

		// ¹®ÀÚ¿­ ¹è¿­ k19_itemnameÀ» ¼±¾ğÇÏ°í ¿ä¼Ò °ªÀ¸·Î »óÇ°¸íÀ» ÁöÁ¤ÇÑ´Ù. 
		String[] k19_itemname = { "¸Æ½É¸ğÄ«°ñµå¸¶ÀÏµåÄ¿ÇÇ¹Í½º(12g*20)", "½ºÆä¼ÈÆ¼Ä«Æä¶ó¶¼¾ÆÆ÷°¡Åä 250ml", "µ¿¼­µÕ±Û·¹Â÷(1.2g*100Æ¼¹é) 120g", "³ó½É½Å¶ó¸é120gX5ÀÔ", "¾ÖÈ£¹Ú", "È¨·±º¼ÃÊÄÚ5¹øµé 230g", "[±¹³»»ê] ´çµµ¼±º° ¼ö¹Ú(Æ¯) 8kg¹Ì¸¸",
				"Ç»¶ó¿¡ÀÌ½º ¿ÀÅõ¿ş¾î ¸¶½ºÅ© KF94 (´ëÇü/¼ÒÇü)50°³", "ÄáÀÌ°¡µæµÎºÎ Âî°³¿ë 300g", "½Ò·Îº° ¿À¸®Áö³Î 156g", "¼­¿ï¿ìÀ¯ 2.3L", "Ç®¹«¿ø ±¹»ê Äá ¼øµÎºÎ (350g)", "CJ ºñºñ°í¿Õ±³ÀÚ490gX2", "ºñ¿ä¶ßÃÊÄÚ¸µ(143g*2°³)", "ÇŞ°¨ÀÚ 900g", "CJ²¿¸¶µ·±î½º 450g",
				"¿Õ°í·¡¹ä 56g", "[¹Ì±¹»ê]°í´çµµÃ¼¸® 454g/ÆÑ", "³ëºê·£µå Åë¾È½ÉÄ¡Å²ÅÙ´õ550g", "ÄÚÄ«Äİ¶ó 215ml 12ÀÔ", "ºê·ÎÄİ¸® 1°³", "³ëºê·£µå °£ÆíÇÑ À¯ºÎÃÊ¹ä 540g", "ÇÇÄÚÅ©»õ¿ìººÀ½¹ä 4+2±âÈ¹ 1260g", "CJ ÇÜ½ººô º£ÀÌÄÁ (110gX3)", "1µî±Ş °è¶õ (15°³ÀÔ/´ë¶õ)",
				"½¡ºÒ¸ÅÄŞ´ß²¿Ä¡ 800g", "CJ ºñºñ°í »ç°ñ°õÅÁ 500g", "»ï¼ºQLED8KTV½ºÅÄµå", "LGÆ®·Ò½ºÆÀ°ÇÁ¶±â RH16WS(¿ë·®: 16kg/È­ÀÌÆ®)", "2020LG±×·¥17" };

		// Á¤¼öÇü ¹è¿­ k19_price¸¦ ¼±¾ğÇÏ°í ¿ä¼Ò °ªÀ¸·Î °¢°¢ÀÇ »óÇ°¿¡ ÇØ´çÇÏ´Â  ´Ü°¡¸¦ ³Ö¾îÁØ´Ù.
		int[] k19_price = { 3180, 1000, 8300, 3380, 1280, 4980, 13900, 75000, 1000, 1190, 4980, 1800, 8480, 2530, 3580, 3880, 980, 10800, 5580, 6880, 1180, 4380, 8580, 7980, 3980, 13980, 1250,
				12900000, 1757500, 1966000 };

		// Á¤¼öÇü ¹è¿­ k19_numÀ» ¼±¾ğÇÏ°í ¿ä¼Ò °ªÀ¸·Î °¢°¢ÀÇ »óÇ°¿¡ ÇØ´çÇÏ´Â ¼ö·®À» ³Ö¾îÁØ´Ù.
		int[] k19_num = { 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 10 };

		//boolean Å¸ÀÔ ¹è¿­ k19_taxfree¸¦ ¼±¾ğÇÏ°í ¿ä¼Ò °ªÀ¸·Î °¢°¢ÀÇ »óÇ°ÀÌ ¸é¼¼ÀÎÁö ¾Æ´ÑÁö¸¦ ³Ö¾îÁØ´Ù.
		boolean[] k19_taxfree = { false, false, false, false, true, false, true, false, true, false, true, true, false, false, true, false, false, false, false, false, true, false, false, false,
				true, false, false, false, false, false };

		double k19_sumTaxfree = 0; //¸é¼¼ ¹°Ç°ÀÇ °¡°İ ÇÕ°è¸¦ ¶æÇÏ´Â ½Ç¼öÇü º¯¼ö k19_sumTaxfree¸¦ ¼±¾ğÇÏ°í 0À¸·Î ÃÊ±âÈ­ ÇÑ´Ù.  
		double k19_sum = 0; // °ú¼¼ ¹°Ç°ÀÇ °¡°İ  °¡°İ ÇÕ°è¸¦ ¶æÇÏ´Â ½Ç¼öÇü º¯¼ö k19_sumÀ» ¼±¾ğÇÏ°í 0À¸·Î ÃÊ±âÈ­ ÇÑ´Ù.  
		double k19_taxrate = 10 / 100.0; // ¼¼À²À» ¶æÇÏ´Â ½Ç¼öÇü º¯¼ö k19_taxrate¸¦ ¼±¾ğÇÏ°í, 10ÇÁ·Î È¯À²À» °è»êÇØ ÀúÀå.
		double k19_tax = 0; //¼¼±İÀ» ¶æÇÏ´Â º¯¼ö k19_tax¸¦ ¼±¾ğÇÏ°í, 0À¸·Î ÃÊ±âÈ­
		DecimalFormat k19_df = new DecimalFormat("###,###,###,###,###"); // DecimalFormat Å¬·¡½ºÀÇ format ¸Ş¼Òµå¸¦ »ç¿ëÇÏ¿© ¼¼ÀÚ¸® ¸¶´ÙÄŞ¸¶¸¦ Âï´Â Æ÷¸Ë k19_df°´Ã¼ »ı¼ºÇÑ´Ù.

		Calendar k19_calt = Calendar.getInstance(); // Calender Å¬·¡½ºÀÇ °´Ã¼ k19_calt¸¦ ¼±¾ğÇÏ°í, getTime()¸Ş¼Òµå¸¦ ÀÌ¿ëÇØ¼­ ÇöÀç½Ã°£À» °¡Á®¿Â´Ù.
		SimpleDateFormat k19_sdt = new SimpleDateFormat("YYYY-MM-dd HH:mm"); // SimpleDateFormat Å¬·¡½ºÀÇ °´Ã¤ k19_sdt¸¦ »ı¼ºÇÏ°í ³¯Â¥Çü½ÄÀ» Á¤ÇÑ´Ù.

		System.out.printf("%33s\n", "ÀÌ¸¶Æ® Á×ÀüÁ¡ (031)888-1234"); //ÀÌ¸¶Æ® Á¡Æ÷¿Í ÀüÈ­¹øÈ£¸¦ Ãâ·Â
		System.out.printf("%7s%21s\n", "emart", "206-86-50913 ÀÌ°©¼ö"); // Á¡Æ÷¿¡ ´ëÇÑ Á¤º¸ Ãâ·Â
		System.out.printf("%28s\n\n", "¿ëÀÎ½Ã ¼öÁö±¸ Æ÷Àº´ë·Î 552"); // Á¡Æ÷ ÁÖ¼Ò Ãâ·Â
		System.out.printf("%s\n", "¿µ¼öÁõ ¹ÌÁöÂü½Ã ±³È¯/È¯ºÒ ºÒ°¡(30ÀÏ³»)"); //¿µ¼öÁõ ±³È¯ È¯ºÒ¿¡ ´ëÇÑ ¾È³» »çÇ× Ãâ·Â
		System.out.printf("%s\n", "±³È¯/È¯ºÒ ±¸¸ÅÁ¡¿¡¼­ °¡´É(°áÁ¦Ä«µåÁöÂü)"); //¿µ¼öÁõ ±³È¯ È¯ºÒ¿¡ ´ëÇÑ ¾È³» »çÇ× Ãâ·Â
		System.out.printf("%s\n", "Ã¼Å©Ä«µå/½Å¿ëÄ«µå Ã»±¸Ãë¼Ò ¹İ¿µÀº"); //¿µ¼öÁõ ±³È¯ È¯ºÒ¿¡ ´ëÇÑ ¾È³» »çÇ× Ãâ·Â
		System.out.printf("%s\n\n", "ÃÖ´ë 3~5ÀÏ ¼Ò¿ä (ÁÖ¸»,°øÈŞÀÏÁ¦¿Ü)"); //¿µ¼öÁõ ±³È¯ È¯ºÒ¿¡ ´ëÇÑ ¾È³» »çÇ× Ãâ·Â
		System.out.printf("%s%-28s%s\n", "[±¸ ¸Å]", k19_sdt.format(k19_calt.getTime()), "POS:0009-2418"); //±¸¸Å ³¯Â¥¿Í Æ÷½º ¹øÈ£ Ãâ·Â
		System.out.printf("------------------------------------------------\n"); //Çì´õ ÀÎ¼â
		System.out.printf("%-2s %-17s%-5s%-11s%s\n", "", "»ó Ç° ¸í", "´Ü °¡", "¼ö·®", "±İ ¾×"); // "»óÇ°¸í", "´Ü°¡", "¼ö·®", "±İ¾×" Ãâ·Â
		System.out.printf("------------------------------------------------\n");
		for (int k19_i = 0; k19_i < k19_itemname.length; k19_i++) { // Á¤¼öÇü º¯¼ö k19_i¸¦ ¼±¾ğÇÏ°í 0À¸·Î ÃÊ±âÈ­ ÇÑ´Ù. k19_i¸¦  itemnameÀÇ ±æÀÌ±îÁö 1¾¿ ´Ã·Á°¡¸é¼­ for¹®À» ¼öÇà

			byte[] k19_b = k19_itemname[k19_i].getBytes(); //byteÅ¸ÀÔ ¹è¿­ k19_b¸¦ ¼±¾ğÇÏ°í k19_itemname[k19_i]ÀÇ ¹ÙÀÌÆ®¸¦ ±¸ÇÑ´Ù.
			String k19_a = new String(k19_b, 0, k19_itemname[k19_i].getBytes().length); //k19_a¸¦ ¼±¾ğÇÏ°í k19_itemname[k19_i]ÀÇ ¹ÙÀÌÆ® ±æÀÌ±îÁö ¹®ÀÚ¿­·Î º¯È¯ÇØ¼­ ÀúÀåÇÑ´Ù.
			if (k19_itemname[k19_i].getBytes().length >= 14) { // k19_itemname[k19_i]ÀÇ ¹ÙÀÌÆ® ±æÀÌ°¡ 14º¸´Ù Å¬ °æ¿ì				
				k19_a = new String(k19_b, 0, 14); // k19_a¸¦ 14 ¹ÙÀÌÆ®±îÁö ¹®ÀÚ¿­·Î º¯È¯ÇØ¼­ ÀúÀåÇÑ´Ù.
				if (k19_itemname[k19_i].substring(7, 8).matches("^[¤¡-¤¾°¡-ÆR]*$")) { //k19_itemname[k19_i]ÀÇ 8¹øÂ° ±ÛÀÚ°¡ ÇÑ±ÛÀÏ °æ¿ì
					k19_a = k19_a.replace(k19_a.substring(k19_a.length() - 1), " "); // k19_aÀÇ ¸¶Áö¸· ±ÛÀÚ¸¦ °ø¹éÀ¸·Î Ä¡È¯ÇÑ´Ù.
				}
			}
			int k19_blank = 25 - k19_a.getBytes().length; //k19_blank¸¦ ¼±¾ğÇÏ°í 25¿¡¼­ k19_aÀÇ ¹ÙÀÌÆ®ÀÇ ±æÀÌ ¸¸Å­ »©ÁØ´Ù.

			if (k19_taxfree[k19_i] == true) { // ¸é¼¼ »óÇ°ÀÏ °æ¿ì
				System.out.printf("%02d* %-1s %" + k19_blank + "s %3d %13s\n", k19_i + 1, k19_a, k19_df.format(k19_price[k19_i]), k19_num[k19_i],
						k19_df.format(k19_price[k19_i] * k19_num[k19_i])); //»óÇ°¸í, ´Ü°¡, ¼ö·®, ±İ¾×À» Ãâ·ÂÇÏ´Âµ¥ »óÇ°¸í ¿·¿¡ *À» Ãâ·ÂÇØÁØ´Ù.
				k19_sumTaxfree += k19_price[k19_i] * k19_num[k19_i]; //¸é¼¼ »óÇ°ÀÇ ÃÑ °¡°İÀÇ ÇÕ°è¸¦ ±¸ÇÑ´Ù.
			} else { //°ú¼¼ »óÇ°ÀÏ °æ¿ì
				System.out.printf("%02d  %-1s %" + k19_blank + "s %3d %13s\n", k19_i + 1, k19_a, k19_df.format(k19_price[k19_i]), k19_num[k19_i],
						k19_df.format(k19_price[k19_i] * k19_num[k19_i])); ////»óÇ°¸í, ´Ü°¡, ¼ö·®, ±İ¾×À» Ãâ·Â
				k19_sum += k19_price[k19_i] * k19_num[k19_i]; //°ú¼¼ »óÇ°ÀÇ ÃÑ °¡°İÀÇ ÇÕ°è¸¦ ±¸ÇÑ´Ù.
			}
		}

		int k19_retPrice = (int) ((k19_sum) * 10 / ((1 + k19_taxrate) * 10)); // ¼¼Àü °¡°İ k19_retPrice¸¦ ¼±¾ğÇÏ°í¹ŞÀ» ±İ¾×¿¡¼­ (1+¼¼À²)À» ³ª´©¾î¼­ °è»êÇØ¼­ÀúÀå
		if ((double) k19_retPrice == (int) k19_retPrice) { //¼¼Àü°¡°İ¿¡  ³ª¿À´Âµ¥ ½Ç¼öÇü°ú Á¤¼öÇüÀÇ °è»ê °ªÀÌ °°À¸¸é
			k19_retPrice = k19_retPrice; // ¼¼Àü°¡°İÀº ¼¼Àü°¡°İÀÌ´Ù.
		} else { //¸¸¾à ½Ç¼öÇü°ú Á¤¼öÇüÀÇ °è»êÀÌ °°Áö ¾ÊÀ¸¸é 
			k19_retPrice = k19_retPrice + 1; // ¼¼Àü °¡°İ¿¡ 1À» ´õÇØÁØ´Ù.(¿Ã¸²Ã³¸®)
		}
		k19_tax = k19_sum - k19_retPrice; //¼¼±İ = ÃÑ¾× - ¼¼Àü°¡°İ
		System.out.printf("%-12s%s%21s\n", "", "(*)¸é ¼¼  ¹° Ç°", k19_df.format(k19_sumTaxfree)); //¸é¼¼ ¹°Ç° °¡°İÀÇ ÃÑ ÇÕ°è¸¦  3ÀÚ¸®¼ö¸¶´Ù ÄŞ¸¶ Âï¾î¼­ Ãâ·Â
		System.out.printf("%-14s%s%21s\n", "", " °ú ¼¼  ¹° Ç°", k19_df.format(k19_retPrice)); // °ú¼¼ ¹°Ç° °¡°İÀÇ ÃÑ ÇÕ°è¸¦  3ÀÚ¸®¼ö¸¶´Ù ÄŞ¸¶ Âï¾î¼­ Ãâ·Â
		System.out.printf("%-15s%s%21s\n", "", "ºÎ   °¡   ¼¼", k19_df.format(k19_tax)); // ºÎ°¡¼¼¸¦  3ÀÚ¸®¼ö¸¶´Ù ÄŞ¸¶ Âï¾î¼­ Ãâ·ÂÇÑ´Ù.
		System.out.printf("%-15s%s%21s\n", "", "ÇÕ        °è", k19_df.format(k19_sum + k19_sumTaxfree)); // °ú¼¼¹°Ç°°ú ¸é¼¼¹°Ç°ÀÇ ÃÑ ÇÕ°è¸¦ ´õÇØ¼­  3ÀÚ¸®¼ö¸¶´Ù ÄŞ¸¶ Âï¾î¼­ Ãâ·Â
		System.out.printf("%s%31s\n", "°á Á¦ ´ë »ó ±İ ¾×", k19_df.format(k19_sum + k19_sumTaxfree)); // °ú¼¼¹°Ç°°ú ¸é¼¼¹°Ç°ÀÇ ÃÑ ÇÕ°è¸¦ ´õÇØ¼­  3ÀÚ¸®¼ö¸¶´Ù ÄŞ¸¶ Âï¾î¼­ Ãâ·Â
		System.out.printf("------------------------------------------------\n");
		System.out.printf("%-1s %-21s %s/%8s\n", "0024", "ÇÏ  ³ª", "5417**8890", "07850246"); //Ä«µå Á¤º¸¸¦ Ãâ·Â
		System.out.printf("%s %23s /%11s\n", "Ä«µå°áÁ¦", "ÀÏ½ÃºÒ", k19_df.format(k19_sum + k19_sumTaxfree)); // Ä«µå °áÁ¦ ³»¿ªÀ» Ãâ·ÂÇÑ´Ù. 
		System.out.printf("------------------------------------------------\n");

	}

}
